# Part 1

### Q1. Download the customer data set and add it to your “Original Data” folder.
### Q2. Create a new notebook in your “Scripts” folder for part 1 of this task.
### Q3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# Import analysis libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Import dataset

path = r'C:\Users\Owner\Desktop\Data Analyst\01-31-2022 Instacart Basket Analysis'

In [3]:
df_customer = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'customers.csv'), index_col = False)

### Q4: Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [4]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_customer.shape

(206209, 10)

#### Rename columns: 'First Name', 'surnam', 'STATE', 'n_dependants' and 'fam_status'

In [6]:
df_customer.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'dependants', 'fam_status' : 'marital_status'}, inplace = True)

In [7]:
df_customer.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
dependants         int64
marital_status    object
income             int64
dtype: object

In [8]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### Change memory size for 'user_id', 'age', 'dependants', 'income'

In [9]:
df_customer = df_customer.astype({"user_id": 'int32', "age": 'int32', "dependants": 'int32', "income" : 'int32'})

In [10]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int32
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int32
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int32
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(4), object(6)
memory usage: 12.6+ MB

#### Drop column 'first_name' - I believe it will not be required in my analysis

In [11]:
df_customer.drop(columns = ['first_name'])

,user_id,surname,gender,state,age,date_joined,dependants,marital_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...
206204,168073,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Noble,Female,New York,55,4/1/2020,1,married,57095

In [12]:
df_customer = df_customer.drop(columns = ['first_name'])

In [13]:
df_customer.head()

,user_id,surname,gender,state,age,date_joined,dependants,marital_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Q5: Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

#### Address missing value

In [14]:
df_customer.isnull().sum()

user_id           0
surname           0
gender            0
state             0
age               0
date_joined       0
dependants        0
marital_status    0
income            0
dtype: int64

There are no missing values in this dataframe

#### Address duplicates

In [15]:
df_dups = df_customer[df_customer.duplicated()]

In [16]:
df_dups

Empty DataFrame
Columns: [user_id, surname, gender, state, age, date_joined, dependants, marital_status, income]
Index: []

There are no duplicates in this dataframe

#### Check mixed-type data

In [17]:
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

There is no mixed-type in this dataframe

### Q6: Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type! Hint: Make sure the key columns are the same data type!

#### Import prepared dataset from task 4.8

In [18]:
ords_prods = pd.read_pickle(r'C:\Users\Owner\Desktop\Data Analyst\01-31-2022 Instacart Basket Analysis\02 Data\Prepared Data\ords_prods_merge.pkl')

#### Check and fix data type

In [19]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int32
 3   orders_day_of_week      int32
 4   orders_time_of_day      int32
 5   days_since_prior_order  float32
 6   df_ords_first_order     bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int32
 10  product_name            object
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float32
 14  price_range_loc         object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int32
 18  loyalty_flag            object
 19  spending                float32
 20  spending_flag           object
 21  order_frequency         float32
 22  frequency_flag          object
dtypes: bool(1), float32(4), int32(11), object(7)
memory usage: 3.8+ GB

In [20]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int32
 1   surname         206209 non-null  object
 2   gender          206209 non-null  object
 3   state           206209 non-null  object
 4   age             206209 non-null  int32
 5   date_joined     206209 non-null  object
 6   dependants      206209 non-null  int32
 7   marital_status  206209 non-null  object
 8   income          206209 non-null  int32
dtypes: int32(4), object(5)
memory usage: 11.0+ MB

In [20]:
# Change object into category for 'ords_prods' dataset

ords_prods['product_name'] = ords_prods['product_name'].astype('category')

In [21]:
ords_prods[['busiest_days', 'busiest_period_of_day', 'price_range_loc']] = ords_prods[['busiest_days', 'busiest_period_of_day', 'price_range_loc']].astype('category')

In [28]:
ords_prods[['loyalty_flag', 'spending_flag', 'frequency_flag']] = ords_prods[['loyalty_flag', 'spending_flag', 'frequency_flag']].astype('category')

In [29]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int32
 3   orders_day_of_week      int32
 4   orders_time_of_day      int32
 5   days_since_prior_order  float32
 6   df_ords_first_order     bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int32
 10  product_name            category
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float32
 14  price_range_loc         category
 15  busiest_days            category
 16  busiest_period_of_day   category
 17  max_order               int32
 18  loyalty_flag            category
 19  spending                float32
 20  spending_flag           category
 21  order_frequency         float32
 22  frequency_flag          category
dtypes: bool(1), category(7), float32(4), int32(11)
memory usage: 2.4 GB

In [30]:
df_merge = ords_prods.merge(df_customer, on = 'user_id', indicator = True)

In [31]:
df_merge.head()

,order_id,user_id,order_number,orders_day_of_week,orders_time_of_day,days_since_prior_order,df_ords_first_order,product_id,add_to_cart_order,reordered,...,frequency_flag,surname,gender,state,age,date_joined,dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Non-frequent customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Non-frequent customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,False,196,1,1,...,Non-frequent customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Non-frequent customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,False,196,1,1,...,Non-frequent customer,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [32]:
df_merge['_merge'].value_counts(dropna = False)

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### Q8: Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [33]:
df_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_customer.pkl'))